---
kind: method
id: M:Autodesk.Revit.DB.ProjectLocation.GetSiteLocation
source: html/b15628ab-b246-233d-6587-9205d2ad04a3.htm
---
# Autodesk.Revit.DB.ProjectLocation.GetSiteLocation Method

Gets the site location to which this project location refers.

## Syntax (C#)
```csharp
public SiteLocation GetSiteLocation()
```

## Remarks
The site location object contains the longitude, latitude, and time-zone
 of the entire project site.